app/controllers/api/v1/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
---
  def index
    post = Post.all.order(created_at: :desc)

INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test Post"], ["body", "aaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa"], ["created_at", "2020-09-27 23:28:23.951608"], ["updated_at", "2020-09-27 23:28:23.951608"]]
---
  def create
    post = Post.create!(post_params)

UPDATE "posts" SET "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["body", "aaaaaaaaaaaaaaaaaaaaaaaaaa"], ["updated_at", "2020-09-27 23:41:13.819955"], ["id", 1]]
---
  def update
    if post.update(post_params)

DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 2]]
---
  def destroy
    post.destroy

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def post
    @post ||=Post.find(params[:id])