app/controllers/api/v1/users_controller.rb

INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "Peter Parker"], ["email", "parker@starkinc.com"], ["password_digest", "spider"], ["created_at", "2020-09-30 05:57:07.826850"], ["updated_at", "2020-09-30 05:57:07.826850"]]
---
  def create
    user = User.create!(user_params)